report_timing > ./reports/timing.rpt
report_area  > ./reports/area.rpt 
report_power > ./reports/power_nosaif.rpt
report_cell > ./reports/cell.rpt
