source ../inputs/clock_uncertainity.tcl
psynopt
route_opt

source generate_report.tcl

save_mw_cel -as route
